## Import the libraries

In [18]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## **Series**

A Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index. The simplest Series is formed from only an array of data:

### Series from list

In [23]:
Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

### Series from Scalar

In [24]:
Series(np.arange(5), index=range(0,5))

0    0
1    1
2    2
3    3
4    4
dtype: int64

### Series from dictionnary

In [25]:
Series({'apple': 4.99,'banana': 1.99,'orange': 3.99,'grapes': 0.99})

apple     4.99
banana    1.99
grapes    0.99
orange    3.99
dtype: float64

## **DataFrame**

### DataFrame from dictionnary of lists

In [26]:
DataFrame({'joe': [2, 4, 6, 8, 10],'jack': [1, 3, 5, 7, 9],'jim': [0, 3, 6, 9, 12]})

   jack  jim  joe
0     1    0    2
1     3    3    4
2     5    6    6
3     7    9    8
4     9   12   10

### DataFrame from dictionnary of Series

In [27]:
DataFrame({'joe': pd.Series([2, 4, 6, 8, 10]),'jack': pd.Series([1, 3, 5, 7]),'jim': [0, 3, 6, 9, 12]})

   jack  jim  joe
0   1.0    0    2
1   3.0    3    4
2   5.0    6    6
3   7.0    9    8
4   NaN   12   10

### DataFrame from a list of dictionnaries

In [32]:
DataFrame([{'jane': 34, 'jim': 99, 'joe': 29, 'jack': 19},{'jane': 78, 'jim': 32, 'joe': 28, 'jack': 60},{'jane': 23, 'jim': 8, 'joe': 20, 'jack': 37}])

   jack  jane  jim  joe
0    19    34   99   29
1    60    78   32   28
2    37    23    8   20

### DataFrame from a Serie

In [34]:
pd.DataFrame(pd.Series([x for x in 'abcde'], name='joe'))

  joe
0   a
1   b
2   c
3   d
4   e